# linux commands

# ctrl + alt + t - command to open terminal

#  ~ - symbol main directory
# / - symbol cornevoy directory

# . - обозначает текущую директорию 
# .. - обозначает предыдущую директорию 

# 1. ls - команда для вывода всех директорий(папка ) и файлов в текущей (рабочей директории в терминале)
# 2. cd (change directory) - команда для перехода из одной директории в другую
# 3. mkdir - создает  directory
# 4, touch - создает файл
# 5. rmdir - удаляет пустую директорию
# 6. rm - удаляет файл
# 7. rm-rf - удаляет вообще все(принудительное удаление)
# 8. ls - a -показыввает скрытые и обычные файлы и директории
#  ls -la - показывает подробную инфу
# 9. pwd(print working directory) - выводит путь до текущей директории
# 10*. cp - копирует файл или директорию в указанное место  
# cp<название><куда>
# 11*. mv - команда для перемещения файла или директории,а также для переименовывания файла или директории
# переименовывание: mv john.txt jamie.txt
# перемещение: mv john.txt directory/
# 12. cat - показывает содержание файла
# 13. nano - открывает файл для редактирование в графическом интерфейсе нано если нет файл он создаст новый
# 14 echo- команда для быстрой записи текста в файл echo текст > файл