# 1) Часы и минуты в секунды: Напишите функцию, которая принимает целочисленные значения 
# часов и минут, конвертирует эти значения в секунды, а затем суммирует их и возвращает в
#  качестве результата.
# def hour_minute(hour,minute):
#     hour_convert = hour * 60 * 60
#     minute_convert = minute * 60
#     return print(hour_convert + minute_convert)
# hour_minute(10,62)
# 2) Возраст в дни: Напишите функцию, которая принимает возраст (количество лет) и
#  преобразует это значение в количество дней.
# def year_days(year):
#     return print(f"Возраст в дни: {year * 365}")
# year_days(21)
# 3) Сколько ног на ферме: Для решения этой задачи необходимо написать функцию,
#  которая посчитает количество ног у всех животных на ферме. На ферме живут курочки, 
# коровки, и свинки. Зная количество животных каждого вида, посчитайте, сколько всего ног 
# у всех животных на ферме.
# def legs_farm():
#     tima = int(input('Введите количество куриц: '))
#     diana = int(input('Введите количество коров: '))
#     lable = int(input('Введите количество свиней: '))
#     tima_leg = 2
#     diana_leg = 4
#     lable_leg = 4
#     sum_legs = 0
#     sum_legs = (tima * tima_leg)+(diana * diana_leg)+(lable * lable_leg)
#     return print(sum_legs)
# legs_farm()


