# ) Создайте переменную x и дайте ей любое числовое значение
# 1.1 Создайте переменную y и дайте ей любое числовое значение
# 1.2 Найдите сумму,произведение,вычитание чисел x,y  . Итоги запишите в другие переменные
# x = 5
# y = 10
# sum = x + y
# division = x * y
# print(sum,division)

# # 2) Создайте переменную name и выведите 'name' 5 раз(Используя print 1 раз)
# name = "name"
# print (name * 5)
# 3) Создайте переменную phone, brand, year дайте им значения
# Вывод данных должен иметь такой вид:

# Модель телефона "phone" компании "brand" "year" года
phone = 'iphone 11'
brand = 'iphone'
year = '2024' 
print( "Модель телефона ", '"'+phone+'"', "компании" ,'"'+brand+'"' , '"'+year+'"' ,"года" )
