"""
1) Создайте переменную float_num и присвойте ей значение с плавающей запятой.
Преобразуйте float_num в целое число и выведите результат.
"""
# float_num = 45.122
# print(round(float_num))
"""
2) Создайте переменную и присвойте ей значение с десятичными знаками.
Округлите его до целого числа и выведите результат.
"""
# num = 1.12
# print(round(num))
"""
3) Напишите программу, которая принимает 3 оценки ученика.
Рассчитайте среднее значение оценок и выведите результат.
"""
# first_grade = int(input("Введите первую оценку: "))
# second_grade = int(input("Введите вторую оценку: "))
# third_grade = int(input("Введите третью оценку: "))
# avg_grade = (first_grade + second_grade + third_grade) / 3
# print(avg_grade)
"""
4) Напишите программу которая принимает число, и выводит на экран факториал этого числа
"""
# from math import factorial
# fac = int(input("Напишите свое число: "))
# print(factorial(fac))

"""
5) Тимофей обычно спит ночью X часов и устраивает себе днем тихий час на Y минут. Определите, сколько всего минут Тимофей спит в сутки.
"""
# x = int(input("Сколько часов спите: "))
# y = int(input("Тихий час: "))
# print("Тимофей спит",(x + y) * 60)
"""
6) Коля каждый день ложится спать ровно в полночь и недавно узнал, что оптимальное время для его сна составляет X минут. Коля хочет поставить себе будильник так, чтобы он прозвенел ровно через X минут после полуночи, однако для этого необходимо указать время сигнала в формате часы, минуты. Помогите Коле определить, на какое время завести будильник. Часы и минуты в выводе программы должны располагаться на разных строках (см. пример работы программы)

Пример ввода: 480
Пример вывода:
8 часов
0 минут
"""
